In [ ]:
import pandas as pd

In [2]:
#[q-1]:
#1:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
#2:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
#3:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
#4:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
#5:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [7]:
#6:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [15]:
#[q-2]:=============================================================================================================
'''
def reindex_df(df):
    new_index = pd.Index(range(1, len(df)*2, 2))
    df = df.set_index(new_index)
    return df
'''
def reindex_df(df):
    df = df.reset_index(drop=True)
    df.index = df.index * 2 + 1
    return df

In [16]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})
print(df)

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [17]:
df = reindex_df(df)
print(df)

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

In [10]:
#[q-3]:
def sum_first_three(df):
    values_sum = df.iloc[:3]['Values'].sum()
    print("Sum of first three values:", values_sum)

In [11]:
df = pd.DataFrame({'Values': [1, 2, 3, 4, 5]})
sum_first_three(df)

Sum of first three values: 6

In [20]:
df

   value
0      5
1     10
2     15
3     20
4     25

In [52]:
#[q-4]:
df=pd.DataFrame({"Text":["hello world","how are you","have a good day"]})

In [53]:
df

              Text
0      hello world
1      how are you
2  have a good day

In [ ]:
df[word_count]=df['Text'].apply(len)

In [ ]:
df

In [ ]:
#[q-5]:
-DataFrame.size and DataFrame.shape are both methods in Pandas used to obtain information about the size of a DataFrame, 
 but they return different values.

-DataFrame.size returns the total number of elements in a DataFrame, i.e., the product of the number of rows and the number of columns.

-DataFrame.shape, on the other hand, returns a tuple representing the dimensions of a DataFrame
 The first element of the tuple is the number of rows, and the second element is the number of columns. 
    
#EXAMPLE:
import pandas as pd
df = pd.DataFrame({'A': [1, 2], 'B': [3, 4], 'C': [5, 6]})
df.size
df.shape

In [ ]:
#[q-6]:
pandas.read_excel()

In [48]:
#[q-7]:
import pandas as pd
d1=pd.DataFrame({"username":["kissu004@.com","raj005@gmail.com","hitesh006@gmail.com"]})

In [49]:
d1

              username
0        kissu004@.com
1     raj005@gmail.com
2  hitesh006@gmail.com

In [50]:
d1["username"]=d1.username.str.extract("(.*)@")

In [51]:
d1

    username
0   kissu004
1     raj005
2  hitesh006

In [41]:
#[q-8]:
data={"A":[1,2,3,4,7,8],"B":[5,6,7,8,4,5],"C":[3,4,6,7,6,5]}
df=pd.DataFrame(data)

In [42]:
df

   A  B  C
0  1  5  3
1  2  6  4
2  3  7  6
3  4  8  7
4  7  4  6
5  8  5  5

In [43]:
df1=df[(df['A']>5) & (df['B']<10)]

In [44]:
df1

   A  B  C
4  7  4  6
5  8  5  5

In [41]:
#[q-9]:
d=pd.DataFrame({'values':[1,3,5,7,9]})

In [42]:
d

   values
0       1
1       3
2       5
3       7
4       9

In [47]:
d['values'].mean()

5.0

In [49]:
d['values'].median()

5.0

In [51]:
d['values'].std()

3.1622776601683795

In [16]:
#[q-10]:
data=pd.DataFrame({"date":['2023-02-01','2023-02-02','2023-02-03','2023-02-04','2023-02-05','2023-02-06','2023-02-07'],'sales':[100,200,300,400,500,600,700]})

In [17]:
data

         date  sales
0  2023-02-01    100
1  2023-02-02    200
2  2023-02-03    300
3  2023-02-04    400
4  2023-02-05    500
5  2023-02-06    600
6  2023-02-07    700

In [18]:
data['moving_average']=data['sales'].rolling(window=7).mean()

In [19]:
data

         date  sales  moving_average
0  2023-02-01    100             NaN
1  2023-02-02    200             NaN
2  2023-02-03    300             NaN
3  2023-02-04    400             NaN
4  2023-02-05    500             NaN
5  2023-02-06    600             NaN
6  2023-02-07    700           400.0

In [70]:
#[q-11]:
data=pd.DataFrame({"date":['2023-03-01','2023-03-02','2023-03-03','2023-03-04','2023-03-05','2023-03-05','2023-03006']})

In [71]:
data

         date
0  2023-03-01
1  2023-03-02
2  2023-03-03
3  2023-03-04
4  2023-03-05
5  2023-03-05
6  2023-03006

In [72]:
data['week_day']=['mpnday','tuesday','wedneaday','thursday','friday','saturday','sunday']

In [73]:
data

         date   week_day
0  2023-03-01     mpnday
1  2023-03-02    tuesday
2  2023-03-03  wedneaday
3  2023-03-04   thursday
4  2023-03-05     friday
5  2023-03-05   saturday
6  2023-03006     sunday

In [14]:
#[q-12]:
data=pd.date_range(start='2023-01-01',end='2023-01-31')

In [15]:
data

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
#[q-13]:
To use the basic functions of pandas, the first and foremost necessary library that needs to be imported is pandas itself.
It is conventionally imported with the alias pd.

import pandas as pd